<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of RingCentral and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.gcts.jss-upload.recipe.jss.RingCentral</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Ring Central</string>
		<key>NAME</key>
		<string>RingCentral</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.gcts.jss-upload.recipe.pkg.RingCentral</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>pkg_path</key>
                        	<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
