<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of RingCentral and creates a package.</string>
	<key>Identifier</key>
	<string>com.gcts.jss-upload.recipe.pkg.RingCentral</string>
	<key>Input</key>
	<dict>
		<key>SOFTWARETITLE</key>
		<string>RingCentral</string>
		<key>NAME</key>
		<string>RingCentral</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.gcts.jss-upload.recipe.download.RingCentral</string>
	<key>Process</key>
	<array>
		<dict>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>destination_path</key>
	 			 <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
	 			 <key>flat_pkg_path</key>
	 			 <string>%pathname%</string>
	 		</dict>
	 		<key>Processor</key>
	 		<string>FlatPkgUnpacker</string>
	  </dict>
	  <dict>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>pattern</key>
	 			 <string>%RECIPE_CACHE_DIR%/downloads/unpack/com.ringcentral.glip.pkg</string>
	 		</dict>
	 		<key>Processor</key>
	 		<string>FileFinder</string>
	  </dict>
	  <dict>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>destination_path</key>
	 			 <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
	 			 <key>pkg_payload_path</key>
	 			 <string>%found_filename%/Payload</string>
	 		</dict>
	 		<key>Processor</key>
	 		<string>PkgPayloadUnpacker</string>
	  </dict>
	  <dict>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>input_plist_path</key>
	 			 <string>%RECIPE_CACHE_DIR%/downloads/payload/RingCentral.app/Contents/Info.plist</string>
	 			 <key>plist_version_key</key>
	 			 <string>CFBundleVersion</string>
	 		</dict>
	 		<key>Processor</key>
	 		<string>Versioner</string>
	  </dict>
	  <dict>
	 		<key>Processor</key>
	 		<string>PkgCopier</string>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>source_pkg</key>
	 			 <string>%pathname%</string>
	 			 <key>pkg_path</key>
	 			 <string>%RECIPE_CACHE_DIR%/Ringcentral_%version%.pkg</string>
	 		</dict>
	  </dict>
	  <dict>
	 		<key>Processor</key>
	 		<string>PathDeleter</string>
	 		<key>Arguments</key>
	 		<dict>
	 			 <key>path_list</key>
	 			 <array>
	 					<string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
	 					<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
	 			 </array>
	 		</dict>
	  </dict>
	 </array>
	</dict>
</plist>
