<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Citrix Workspace version and renames the package.</string>
      <key>Identifier</key>
      <string>com.gcts.jss-upload.recipe.pkg.citrixworkspace</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Citrix Workspace</string>
         <key>VENDOR</key>
         <string>Citrix</string>
         <key>SOFTWARETITLE</key>
         <string>Workspace</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.citrixworkspace</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>flat_pkg_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_payload_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack/com.citrix.ICAClient.pkg/Payload</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Comment</key>
            <string>Get version from the pkg</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%//downloads/payload/Citrix Workspace.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%/</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            </dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                </array>
             </dict>
         </dict>
      </array>
   </dict>
</plist>
